EcSUHA/ESP32_Device/components/BH1750_Module/BH1750_Module.c
/* #################################################################################################
 *
 *      Name: BH1750 Module
 *  Function: This is used to set up GPIOs as a switch with the goal to control switching hardware
 *            (relay, ...). The GPIO switching is Hardware PWM driven (for ESP32 SOC only). 
 *            Module for use with SCDE (Smart Connected Device Engine) only !
 *
 *  ESP 8266EX & ESP32 SoC Activities ...
 *  HoME CoNTROL & Smart Connected Device Engine Activities ...
 *  Copyright by EcSUHA
 *
 *  Created by Maik Schulze, Sandfuhren 4, 38448 Wolfsburg, Germany for EcSUHA.de 
 *
 *  MSchulze780@GMAIL.COM
 *  EcSUHA - ECONOMIC SURVEILLANCE AND HOME AUTOMATION - WWW.EcSUHA.DE
 * #################################################################################################
 *
 *define myBH1750 BH1750 I2CM
 */



#include <ProjectConfig.h>
#include <esp8266.h>
#include <Platform.h>



// the Smart-Connected-Device-Engine structures & types ...
#include <SCDE_s.h>

// provides WebIf, need the structures & types ...
#include "WebIf_Module.h"

// this Module uses an 1st stage, need the structures & types ...
#include "ESP32_I2C_Master_Module_s.h"

// this Modules structures & types ...
#include "BH1750_Module.h"

#include "SCDE_Main.h"



// -------------------------------------------------------------------------------------------------

// set default build verbose - if no external override
#ifndef BH1750_Module_DBG  
#define BH1750_Module_DBG  5	// 5 is default
#endif 

// -------------------------------------------------------------------------------------------------

#include <WebIf_EspFSStdFileTX.h>
#include <WebIf_EspFSAdvFileTX.h>

#include "HTools_cgi.h"
#include <ServAPCfg_tpl.h>
#include <CGI_Redirect.h>



// -------------------------------------------------------------------------------------------------



/*
 * Implemented Values for Keys
 */

// BH1750_SET_SIG_OUT_EN -> 'SIG_OUT_EN' -> Disabled|Enabled
SelectAData BH1750_DisEna[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"Disabled"},
  {1,"Enabled"}, 
  {0, NULL}
  };

// BH1750_SET_IDLE_LV -> 'IDLE_LV' -> Low|High
SelectAData BH1750_LoHi[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"Low"},
  {1,"High"}, 
  {0, NULL}
  };

// BH1750_SET_BLOCK -> 'PWM_BLOCK'-> High_Speed|Low_Speed
SelectAData BH1750_PWM_BLOCK[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"High_Speed"},
  {1,"Low_Speed"},
  {0, NULL}
  };

// BH1750_SET_TICK_SOURCE -> 'TICK_SOURCE'-> REF|APB_SLOW
SelectAData BH1750_TICK_SOURCE[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"REF"},
  {1,"APB_SLOW"}, 
  {0, NULL}
  };



/**
 * For Type: BH1750
 * Implemented-Args-Keys, for input (MAX 64!). //IAK!!
 * KEYs-Field-Set for Feature specific query. Will be generated by SCDEH_ParseStrToparsedKVInput()
 * parsed result is stored in BH1750_parsedKVInput_t
 */
enum BH1750_SET_IK {				// Bit #XX for debugging

  // S0 calculation configuration
    BH1750_SET_ON		= 0			// Bit #00 'ON'  -> 
  , BH1750_SET_OFF				// Bit #01 'OFF'  -> 

  , BH1750_SET_MAX				// Bit #02 'MAX'  -> 
  , BH1750_SET_MIN				// Bit #03 'MIN'  -> 

  , BH1750_SET_VAL				// Bit #04 'VAL'  -> 
  , BH1750_SET_DIM				// Bit #05 'DIM'  -> 

  , BH1750_SET_NAME				// Bit #06 'NAME'  -> 
  , BH1750_SET_CAPS				// Bit #07 'CAPS'  -> 

  // Block #01 PWM configuration
  , BH1750_SET_GPIO				// Bit #08 'GPIO' -> 
  , BH1750_SET_BLOCK				// Bit #09 'BLOCK' -> 
  , BH1750_SET_CHANNEL				// Bit #10 'CHANNEL' -> 
  , BH1750_SET_TIMER				// Bit #11 'TIMER' -> 

  , BH1750_SET_DUTY				// Bit #12 'DUTY' ->
  , BH1750_SET_HPOINT				// Bit #13 'HPOINT' ->
  , BH1750_SET_SIG_OUT_EN				// Bit #14 'SIG_OUT_EN' ->
  , BH1750_SET_IDLE_LV				// Bit #15 'IDLE_LV' ->

  , BH1750_SET_RESOLUTION			// Bit #16 'RESOLUTION' -> 
  , BH1750_SET_TICK_SOURCE			// Bit #17 'TICK_SOURCE' ->
  , BH1750_SET_FREQ_HZ				// Bit #18 'FREQ_HZ' ->

  , BH1750_SET_THR_L_LIM_EN			// Bit #19 'THR_L_LIM_EN' -> DIS/ENA
  , BH1750_SET_THR_H_LIM_EN			// Bit #20 'THR_H_LIM_EN' -> DIS/ENA
  , BH1750_SET_THR_ZERO_EN			// Bit #21 'THR_ZERO_EN' -> DIS/ENA
  , BH1750_SET_FILTER_EN				// Bit #22 'FILTER_EN' -> DIS/ENA
  , BH1750_SET_FILTER_THRES			// Bit #23 'FILTER_THRES' -> decval 10 bit zahl
  , BH1750_SET_CNT_THRES1				// Bit #24 'CNT_THRES1' -> decval 16 bit zahl
  , BH1750_SET_CNT_THRES0				// Bit #25 'CNT_THRES0' -> decval 16 bit zahl
  , BH1750_SET_CNT_L_LIM				// Bit #26 'CNT_L_LIM' -> decval 10 bit zahl
  , BH1750_SET_CNT_H_LIM				// Bit #27 'CNT_H_LIM' -> decval 10 bit zahl

// end marker
  , BH1750_SET_IK_Number_of_keys			// Bit #27 MAX 64 IMPLEMENTED !

};

 

/**
 * For Type: BH1750
 * Implemented readings (MAX 32!)
 * Can be assigned to Implemented Keys, if affected
 */
enum BH1750_Readings {			// Bit #XX for debugging

   BH1750_R_DUTY		= (1<<0)	// Bit #00 'Duty'  -> 

  ,BH1750_R_RESOLUTION	= (1<<1)	// Bit #01 'Resolution' -> 

  ,BH1750_R_NAME		= (1<<2)	// Bit #02 'name' + caps + ufid -> 

};



/**
 * For Type: BH1750
 * Implemented KEYS and assigned readings for this query - analyzed by by http_parser_parse_url()

 * Num should meet enum XX_QueryFields
 * Result is stored in struct SCDE_XX_parsedKVInput
 */
kvParseImplementedKeys_t BH1750_Set_ImplementedKeys[] = {
// |                                                          affected readings										              	|  CMD

// for usage 
   { BH1750_R_DUTY | BH1750_R_RESOLUTION															, "ON" }		// #00
  ,{ BH1750_R_DUTY | BH1750_R_RESOLUTION															, "OFF" }		// #01
  ,{ BH1750_R_DUTY | BH1750_R_RESOLUTION															, "MAX" }		// #02
  ,{ BH1750_R_DUTY | BH1750_R_RESOLUTION															, "MIN" }		// #03
  ,{ BH1750_R_DUTY | BH1750_R_RESOLUTION															, "VAL" }		// #04
  ,{ BH1750_R_DUTY | BH1750_R_RESOLUTION															, "DIM" }		// #05

  ,{ BH1750_R_DUTY | BH1750_R_RESOLUTION | BH1750_R_NAME												, "NAME" }		// #06
  ,{ BH1750_R_DUTY | BH1750_R_RESOLUTION | BH1750_R_NAME												, "CAPS" }		// #07

// for configuration
  ,{ 0																					, "GPIO" }		// #08
  ,{ 0																					, "BLOCK" }		// #09
  ,{ 0																					, "CHANNEL" }		// #10
  ,{ 0																					, "TIMER" }		// #11
  ,{ 0																					, "DUTY" }		// #12
  ,{ 0																					, "HPOINT" }		// #13
  ,{ 0																					, "SIG_OUT_EN" }	// #14
  ,{ 0																					, "IDLE_LV" }		// #15

  ,{ 0																					, "RESOLUTION" }		// #16
  ,{ 0																					, "TICK_SOURCE" }	// #17
  ,{ 0																					, "FREQ_HZ" }		// #18

  ,{ 0																					, "THR_L_LIM_EN" }	// #19
  ,{ 0																					, "THR_H_LIM_EN" }	// #20
  ,{ 0																					, "THR_ZERO_EN" }	// #21
  ,{ 0																					, "FILTER_EN" }		// #22
  ,{ 0																					, "FILTER_THRES" }	// #23
  ,{ 0																					, "CNT_THRES1" }	// #24
  ,{ 0																					, "CNT_THRES0" }	// #25
  ,{ 0																					, "CNT_L_LIM" }		// #26
  ,{ 0																					, "CNT_H_LIM" }		// #27

}; // number of elements should be equal with XX_SET_IK_Number_of_keys, LIMIT IS 64 ELEMENTS !



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: BH1750_ActiveResourcesDataA_forWebIf
 *  Desc: Resource-Content-structure of active Directory - PART A (Resource-Data-Row)
 *  Data: WebIf_ActiveResourcesDataA_t[X] from HttpD.h
 * -------------------------------------------------------------------------------------------------
 */
// Content:   AllowedMethodBF          | AllowedDocMimeBF  | AllowedSchemeBF |free|CgiNo| EnaByBit | Url
const WebIf_ActiveResourcesDataA_t BH1750_ActiveResourcesDataA_forWebIf[] = {  //ICACHE_RODATA_ATTR = 

  // SOC Hardware Cfg
  { 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  0, 0b00000000, "/SoCHWCfg"}

  // WiFi Stations Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  1, 0b00000000, "/WiFi/StationCfg"}

  // WIFI Q-Connect PAGES
 ,{ 0b00000000000000000000000000001010, 0b0000000000000010, 0b0000000000000001,  0,  2, 0b00000000, "/WiFi/QConnect"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000001000, 0b0000000000000001,  0,  3, 0b00000000, "/WiFi/WiFiScan"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000000100, 0b0000000000000001,  0,  4, 0b00000000, "/WiFi/Connect"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000000100, 0b0000000000000001,  0,  5, 0b00000000, "/WiFi/Setmode"}

  // Service Access Point Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  6, 0b00000000, "/WiFi/ServAPCfg"}

  // TimeStamp Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  7, 0b00000000, "/TiStCfg"}

  // Firmware Update
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  8, 0b00000000, "/Firmware"}

  // Redirects
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0,  9, 0b00000000, "/WiFi"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0,  9, 0b00000000, "/WiFi/"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0, 10, 0b00000000, "/"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000010, 0b0000000000000001,  0, 10, 0b00000000, "/index"}	// .htm

