EcSUHA/ESP32_Device/components/BH1750_Module/BH1750_Module.c
	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Parsing Error! Expected Args!");

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

  // store FD to Definition. Will than be processed in global loop ... -> THIS MODULE USES NO FD
  BH1750_Definition->common.fd = -1;

// ------------------------------------------------------------------------------------------------

  // init WebIf_Provided offset
//  ESP32Control_Definition->common.link =
//	&ESP32Control_Definition->WebIf_Provided;

  // check for loaded Module 'WebIf' -> get provided Fn
  BH1750_Definition->WebIf_Provided.WebIf_FnProvided =
	NULL;//(WebIf_FnProvided_t *) SCDEFn_at_BH1750_M->GetFnprovided("WebIf");

 // Providing data for WebIf? Initialise data provided for WebIf
  if (BH1750_Definition->WebIf_Provided.WebIf_FnProvided) {

	BH1750_Definition->WebIf_Provided.ActiveResourcesDataA =
		(WebIf_ActiveResourcesDataA_t *) &BH1750_ActiveResourcesDataA_forWebIf;

	BH1750_Definition->WebIf_Provided.ActiveResourcesDataB =
		(WebIf_ActiveResourcesDataB_t *) &BH1750_ActiveResourcesDataB_forWebIf;

	}

  else	{

	SCDEFn_at_BH1750_M->Log3Fn(Common_Definition->name
		,Common_Definition->nameLen
		,1
		,"Could not enable WebIf support for '%.*s'. Type '%.*s' detects Type 'WebIf' is NOT loaded!"
		,BH1750_Definition->common.nameLen
		,BH1750_Definition->common.name
		,BH1750_Definition->common.module->provided->typeNameLen
		,BH1750_Definition->common.module->provided->typeName);
	}

// ------------------------------------------------------------------------------------------------

  // Parse define-args (KEY=VALUE) protocol -> gets parsedKVInput in allocated mem, NULL = ERROR
  parsedKVInputArgs_t *parsedKVInput = 
	SCDEFn_at_BH1750_M->ParseKVInputArgsFn(BH1750_SET_IK_Number_of_keys	// Num Implementated KEYs MAX
	,BH1750_Set_ImplementedKeys				// Implementated Keys
	,defArgsText							// our args text
	,defArgsTextLen);						// our args text len

  // parsing may report an problem. args contain: unknown keys, double keys, ...?
  if (!parsedKVInput) {

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Parsing Error! Args '%.*s' not taken! Check the KEYs!"
		,defArgsTextLen
		,defArgsText);

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------






// ------------------------------------------------------------------------------------------------

  // set required Keys -> Keys that should be there in this request
  parsedKVInput->requiredKVBF = ( (1 << BH1750_SET_GPIO)
			        | (1 << BH1750_SET_BLOCK)
			        | (1 << BH1750_SET_CHANNEL)
			        | (1 << BH1750_SET_TIMER)
			        | (1 << BH1750_SET_DUTY)
			        | (1 << BH1750_SET_HPOINT)
			        | (1 << BH1750_SET_SIG_OUT_EN)
			        | (1 << BH1750_SET_IDLE_LV)
			        | (1 << BH1750_SET_RESOLUTION)
			        | (1 << BH1750_SET_TICK_SOURCE)
			        | (1 << BH1750_SET_FREQ_HZ) );

  // set forbidden Keys -> Keys that are not allowed in this request
  parsedKVInput->forbiddenKVBF = 0;
/*
  // process the set-args (key=value@) protocol
  if (BH1750_ProcessKVInputArgs(BH1750_Definition
	,parsedKVInput				// KVInput parsed
	,defArgsText				// our args text
	,defArgsTextLen) ) {			// our args text len

	// Processing reports an problem. Args not taken. Response with error text.

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Processing Error! Args '%.*s' not taken! Check the VALUEs!"
		,defArgsTextLen
		,defArgsText);

	// free allocated memory for query result key-field
	free(parsedKVInput);

	return retMsg;

  }
*/
// ------------------------------------------------------------------------------------------------

  // set affected readings
 // BH1750_SetAffectedReadings(BH1750_Definition
//	,parsedKVInput->affectedReadingsBF);

// ------------------------------------------------------------------------------------------------

  // free allocated memory for query result key-field
  free(parsedKVInput);

// ------------------------------------------------------------------------------------------------
//play here

  // temp build 'ESP32_I2C_Master'
	BH1750_Definition->stage1definitionNameLen = 
		asprintf(&BH1750_Definition->stage1definitionName,"I2CM");
/*
  // get definition of 1st stage definition we want to use for tx/rx
  ESP32_I2C_Master_Definition_t* ESP32_I2C_Master_Definition_Stage1;

  ESP32_I2C_Master_Definition_Stage1 = SCDEFn_at_BH1750_M->GetDefinitionPtrByNameFn(
		 BH1750_Definition->stage1definitionNameLen
		,BH1750_Definition->stage1definitionName);
*/

  // make common ptr to modul specific ptr
  ESP32_I2C_Master_Definition_t* ESP32_I2C_Master_Definition =
		  (ESP32_I2C_Master_Definition_t*) SCDEFn_at_BH1750_M->GetDefinitionPtrByNameFn(
		 BH1750_Definition->stage1definitionNameLen
		,BH1750_Definition->stage1definitionName);


  if (ESP32_I2C_Master_Definition) {

	SCDEFn_at_BH1750_M->Log3Fn(Common_Definition->name
		,Common_Definition->nameLen
		,1
		,"Found first Stage with name '%.*s'. Type '%.*s' !"
		,ESP32_I2C_Master_Definition->common.nameLen
		,ESP32_I2C_Master_Definition->common.name
		,ESP32_I2C_Master_Definition->common.module->provided->typeNameLen
		,ESP32_I2C_Master_Definition->common.module->provided->typeName);

	// store table of function callbacks provided & made accessible from stage 1 Module
	ESP32_I2C_Master_Fn_t* ESP32_I2C_Master_Fn =
		ESP32_I2C_Master_Definition->ESP32_I2C_Master_Fn;




#define DATA_LENGTH          512  /*!<Data buffer length for test buffer*/
#define RW_TEST_LENGTH       129  /*!<Data length for r/w test, any value from 0-DATA_LENGTH*/
#define DELAY_TIME_BETWEEN_ITEMS_MS   1234 /*!< delay time between different test items */


#define BH1750_SENSOR_ADDR  0x23    /*!< slave address for BH1750 sensor */
#define BH1750_CMD_START    0x23    /*!< Command to set measure mode */
#define ESP_SLAVE_ADDR 0x28         /*!< ESP32 slave address, you can set any 7bit value */
#define WRITE_BIT  I2C_MASTER_WRITE /*!< I2C master write */
#define READ_BIT   I2C_MASTER_READ  /*!< I2C master read */
#define ACK_CHECK_EN   0x1     /*!< I2C master will check ack from slave*/
#define ACK_CHECK_DIS  0x0     /*!< I2C master will not check ack from slave */
#define ACK_VAL    0x0         /*!< I2C ack value */
#define NACK_VAL   0x1         /*!< I2C nack value */



   int i = 0;
 //   int ret;
 //   uint32_t task_idx = (uint32_t) arg;
    uint8_t* data = (uint8_t*) malloc(DATA_LENGTH);
    uint8_t* data_wr = (uint8_t*) malloc(DATA_LENGTH);
    uint8_t* data_rd = (uint8_t*) malloc(DATA_LENGTH);
    uint8_t sensor_data_h = 0;
    uint8_t sensor_data_l = 0;

 //   while (1) {
//        ret = i2c_master_sensor_test( I2C_MASTER_NUM, &sensor_data_h, &sensor_data_l);

    // I2C ...

    // create linked list head for i2c commands 
    i2c_cmd_handle_t cmd = ESP32_I2C_Master_Fn->i2c_cmd_link_createFn();
    // append to linked list: initial master start cmd with cmd.op_code = I2C_CMD_RESTART
    ESP32_I2C_Master_Fn->i2c_master_startFn(cmd);
    // append to linked list: write master cmd with cmd.op_code = I2C_CMD_WRITE and the byte
    ESP32_I2C_Master_Fn->i2c_master_write_byteFn(cmd, BH1750_SENSOR_ADDR << 1 | WRITE_BIT, ACK_CHECK_EN);
    // append to linked list: write master cmd with cmd.op_code = I2C_CMD_WRITE and the byte
    ESP32_I2C_Master_Fn->i2c_master_write_byteFn(cmd, BH1750_CMD_START, ACK_CHECK_EN);
    // append to linked list: final stop cmd with cmd.op_code = I2C_CMD_STOP 
    ESP32_I2C_Master_Fn->i2c_master_stopFn(cmd);
/*
    // exec linked list!
    ret = ESP32_I2C_Master_Fn->i2c_master_cmd_beginFn(ESP32_I2C_Master_Definition->i2c_obj,
	cmd, 1000 / portTICK_RATE_MS);
    // loops through the linked list cmd elements, frees them + finally frees the linked list head too
    ESP32_I2C_Master_Fn->i2c_cmd_link_deleteFn(cmd);

    if (ret == ESP_FAIL) {
       // return ret;
    }*/

  String_t datax;
  datax.p_char = (uint8_t*) cmd;
  datax.len = 8; //???

