EcSUHA/ESP32_Device/components/BH1750_Module/BH1750_Module.c
  retMsg = ESP32_I2C_Master_Definition->common.module->provided->WriteFn(ESP32_I2C_Master_Definition, datax);

  if (retMsg) {

       // error occured - no further processing - return retMsg;
  }
    else {
	vTaskDelay(30 / portTICK_RATE_MS);

	cmd = ESP32_I2C_Master_Fn->i2c_cmd_link_createFn();
	ESP32_I2C_Master_Fn->i2c_master_startFn(cmd);
	ESP32_I2C_Master_Fn->i2c_master_write_byteFn(cmd, BH1750_SENSOR_ADDR << 1 | READ_BIT, ACK_CHECK_EN);
	ESP32_I2C_Master_Fn->i2c_master_read_byteFn(cmd, &sensor_data_h, ACK_VAL);
	ESP32_I2C_Master_Fn->i2c_master_read_byteFn(cmd, &sensor_data_l, NACK_VAL);
	ESP32_I2C_Master_Fn->i2c_master_stopFn(cmd);
/*
    ret = ESP32_I2C_Master_Fn->i2c_master_cmd_beginFn(ESP32_I2C_Master_Definition->i2c_obj,
		 cmd, 1000 / portTICK_RATE_MS);
    ESP32_I2C_Master_Fn->i2c_cmd_link_deleteFn(cmd);
    if (ret == ESP_FAIL) {
     //   return ESP_FAIL;
    }
    else {
    ret = ESP_OK;
    }
*/

	datax.p_char = (uint8_t*) cmd;
	datax.len = 8; //???

	retMsg = ESP32_I2C_Master_Definition->common.module->provided->WriteFn(ESP32_I2C_Master_Definition, datax);

	if (retMsg) {

		// error occured 
	}
  }

  vTaskDelay(200 / portTICK_RATE_MS);

 //       xSemaphoreTake(print_mux, portMAX_DELAY);
  printf("*******************\n");
  printf("MASTER READ SENSOR( BH1750 )\n");
  printf("*******************\n");
  if (!retMsg) {
	printf("data_h: %02x\n", sensor_data_h);
	printf("data_l: %02x\n", sensor_data_l);
	printf("sensor val: %f\n", ( sensor_data_h << 8 | sensor_data_l ) / 1.2);
  } else {
	printf("No ack, sensor not connected...skip...\n");
  }



  }


// ------------------------------------------------------------------------------------------------

  // set up 1st idle Callback
  BH1750_Definition->common.Common_CtrlRegA |= F_WANTS_IDLE_TASK;

  return retMsg;

// XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
/*
// alternative end in case of errors - free/destroy all allocated things and return SCDE_FAIL.
  err:

  if (parsedKVInput) {

    free(parsedKVInput);

  }

  return retMsg;
*/
}



/*
 * ------------------------------------------------------------------------------------------------
 *  FName: BH1750_IdleCb	
 *  Desc: Timed callback, X Hz, to do type dependend processing tasks.
 *  Info: 
 *  Para: Common_Definition_t *Common_Definition -> prefilled WebIf Definition 
 *  Rets: ? unclear char* -> response text NULL=no text
 * ------------------------------------------------------------------------------------------------
 */
int
BH1750_IdleCb(Common_Definition_t *Common_Definition)
{

  // prepare STAILQ head for multiple RetMsg storage
  struct headRetMsgMultiple_s headRetMsgMultiple;

  // Initialize the queue
  STAILQ_INIT(&headRetMsgMultiple);

  // make common ptr to modul specific ptr
  BH1750_Definition_t *BH1750_Definition =
		  (BH1750_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_BH1750_Module_DBG >= 5
  printf("\n|ESP32_BH1750_IdleCb, Def-Name:%.*s>"
	,ESP32_BH1750_Definition->common.nameLen
	,ESP32_BH1750_Definition->common.name);
  #endif

// -------------------------------------------------------------------------------------------------

  // get definition of 1st stage definition we want to use for tx/rx
  ESP32_I2C_Master_Definition_t *ESP32_I2C_Master_Definition_Stage1;

  ESP32_I2C_Master_Definition_Stage1 = SCDEFn_at_BH1750_M->GetDefinitionPtrByNameFn(
		 BH1750_Definition->stage1definitionNameLen
		,BH1750_Definition->stage1definitionName);

  // prepare further specific Stage exchange data
  ESP32_I2C_Master_StageXCHG_t *ESP32_I2C_Master_StageXCHG = NULL;

  // call stage 1, if found
  if (ESP32_I2C_Master_Definition_Stage1) {
/*
	// and 
	if (Common_Definition->module->provided->DirectWriteFn) {

		// call modules DirectWriteFn, if retMsg != NULL -> interpret as veto
		strTextMultiple_t *retMsg =  
			Common_Definition->module->provided->DirectWriteFn(
			 ESP32_I2C_Master_Definition_Stage1
			,ESP32_BH1750_Definition
			,ESP32_I2C_Master_StageXCHG);

		// got an error msg?
		if (retMsg) {

			// insert retMsg in stail-queue
			STAILQ_INSERT_TAIL(&headRetMsgMultiple, retMsg, entries);
		}
	}
*/
  }

  // stage 1 not found, log note
  else {

  }

// -------------------------------------------------------------------------------------------------



// -------------------------------------------------------------------------------------------

/* Description of state machine for BH1750 data query (light intensity)
 *
 * State0: initial delay
 *
 * State1: set mode
 * _________________________________________________________________
 * | start | slave_addr + wr_bit + ack | write 1 byte + ack  | stop |
 * --------|---------------------------|---------------------|------|
 *
 * State2: wait more than 24 ms
 *
 * State3: read sensor data
 * ______________________________________________________________________________________
 * | start | slave_addr + rd_bit + ack | read 1 byte + ack  | read 1 byte + nack | stop |
 * --------|---------------------------|--------------------|--------------------|------|
 *
 * State4: wait ?
 *
 * State5: goto step 3?
 *
 */



#define BH1750_SENSOR_ADDR  0x23	// slave address for BH1750 sensor
#define BH1750_CMD_START    0x23	// Command to set measure mode
#define WRITE_BIT  I2C_MASTER_WRITE	// I2C master write
#define READ_BIT   I2C_MASTER_READ	// I2C master read
#define ACK_CHECK_EN   0x1		// I2C master will check ack from slave
#define ACK_CHECK_DIS  0x0		// I2C master will not check ack from slave
#define ACK_VAL    0x0			// I2C ack value
#define NACK_VAL   0x1			// I2C nack value

/*
  // storage for our I2C command queue
  i2c_cmd_handle_t cmd;

  esp_err_t ret;

//  enum ESP32_BH1750_QueryStates ESP32_BH1750_Definition->BH1750_QueryState;
//  enum state p_state = (enum state) conn->parser_state;

  enum ESP32_BH1750_QueryStates p_state = 
       (enum ESP32_BH1750_QueryStates) ESP32_BH1750_Definition->BH1750_QueryState;

  // enter the state machine for sensor data query
  switch (p_state) {// its ESP32_BH1750_Definition->BH1750_QueryState) {

