EcSUHA/ESP32_Device/components/BH1750_Module/BH1750_Module.c
	case s_ESP32_INTIAL_DELAY:		// #00

		state = s_ESP32_BH1750_SET_MODE;
		break;


	// JOB: create + execute set BH1750 mode command
	case s_ESP32_BH1750_SET_MODE: 		// #01

		cmd = i2c_cmd_link_create();

		i2c_master_start(cmd);

		i2c_master_write_byte(cmd, BH1750_SENSOR_ADDR << 1 | WRITE_BIT, ACK_CHECK_EN);

		i2c_master_write_byte(cmd, BH1750_CMD_START, ACK_CHECK_EN);

		i2c_master_stop(cmd);

		// send job to our IO-Device TX
//		int ret = callIoDev (cmd);

		state = s_ESP32_BH1750_SET_MODE_EXEC;
		break;


	// JOB: wait till set mode is finnished
	//      - set a delay
	case s_ESP32_BH1750_SET_MODE_EXEC: 	// #02

		i2c_cmd_link_delete(cmd);

	// we have a result / OK
        if (ret == ESP_OK) {

		#if ESP32_BH1750_Module_DBG >= 5
 		printf("|Set Mode OK>");
		#endif
	}

	// we have no result / error
	else {

		#if ESP32_BH1750_Module_DBG >= 5
		printf("|No ack, sensor not connected...skip...>");
		#endif 

 //		go to state 0 here return ESP_FAIL;
        }

     break;

     case s_ESP32_BH1750_WAIT_24MS:	// #02
     break;

     case s_ESP32_BH1750_READ_DATA:	// #03

        cmd = i2c_cmd_link_create();

        i2c_master_start(cmd);

        i2c_master_write_byte(cmd, BH1750_SENSOR_ADDR << 1 | READ_BIT, ACK_CHECK_EN);

        i2c_master_read_byte(cmd, &ESP32_BH1750_Definition->sensor_data_h, ACK_VAL);

        i2c_master_read_byte(cmd, &ESP32_BH1750_Definition->sensor_data_l, NACK_VAL);

        i2c_master_stop(cmd);

        // call our IO-Device TX
//        int ret = callIoDev (cmd);
i2c_cmd_link_delete(cmd);

	// we have a result
        if (ret == ESP_OK) {

           #if ESP32_BH1750_Module_DBG >= 5
           printf("|data_h: %02x, data_l: %02x, sensor val: %f>"
              ,ESP32_BH1750_Definition->sensor_data_h
              ,ESP32_BH1750_Definition->sensor_data_l
              ,(ESP32_BH1750_Definition->sensor_data_h << 8 | ESP32_BH1750_Definition->sensor_data_l ) / 1.2);
           #endif
        }

        // we have no result / error
        else {

           #if ESP32_BH1750_Module_DBG >= 5
           printf("|No ack, sensor not connected...skip...>");
           #endif

        }

 //       state = 3;

     break;

}
*/

/*
    case 3:
      Ampel1( ROT );
      Ampel2( ROT );
      state = 4;
      break;

    case 4:
      Ampel1( ROT_GELB );
      Ampel2( ROT );
      state = 5;
      break;

    case 5:
      Ampel1( GRUEN );
      Ampel2( ROT );
      state = 6;
      break;

    case 6:
      Ampel1( GELB );
      Ampel2( ROT );
      state = 7;
      break;

    case 7:
      Ampel1( ROT );
      Ampel2( ROT );
      state = 8;
      break;

    case 8:
      Ampel1( ROT );
      Ampel2( ROT_GELB );
      state = 1;
      break;
  }
}

















esp_err_t i2c_master_sensor_test(i2c_port_t i2c_num, uint8_t* data_h, uint8_t* data_l)
{

  i2c_cmd_handle_t cmd;

 state 1:
  cmd = i2c_cmd_link_create();
  i2c_master_start(cmd);
  i2c_master_write_byte(cmd, BH1750_SENSOR_ADDR << 1 | WRITE_BIT, ACK_CHECK_EN);
  i2c_master_write_byte(cmd, BH1750_CMD_START, ACK_CHECK_EN);
  i2c_master_stop(cmd);

  // call our IO-Device TX
  int ret = callIoDev (cmd);

  if (ret == ESP_FAIL) {
	printf("No ack, sensor not connected...skip...\n");
        go to state 0 here return ESP_FAIL;
    }



 state 3:

  cmd = i2c_cmd_link_create();
  i2c_master_start(cmd);
  i2c_master_write_byte(cmd, BH1750_SENSOR_ADDR << 1 | READ_BIT, ACK_CHECK_EN);
  i2c_master_read_byte(cmd, &ESP32_BH1750_Definition->data_h, ACK_VAL);
  i2c_master_read_byte(cmd, &ESP32_BH1750_Definition->data_l, NACK_VAL);
  i2c_master_stop(cmd);

  // call our IO-Device TX
  int ret = callIoDev (cmd);

  if (ret == ESP_OK) {
	printf("data_h: %02x\n", ESP32_BH1750_Definition->sensor_data_h);
	printf("data_l: %02x\n", ESP32_BH1750_Definition->sensor_data_l);
	printf("sensor val: %f\n",
		( ESP32_BH1750_Definition->sensor_data_h << 8 | ESP32_BH1750_Definition->sensor_data_l ) / 1.2);
  }

  else {
	printf("No ack, sensor not connected...skip...\n");
  }

*/





/* test code to write esp-i2c-slave
 *
 * 1. set mode
 * _________________________________________________________________
 * | start | slave_addr + wr_bit + ack | write 1 byte + ack  | stop |
 * --------|---------------------------|---------------------|------|
 * 2. wait more than 24 ms
 * 3. read data
 * ______________________________________________________________________________________
 * | start | slave_addr + rd_bit + ack | read 1 byte + ack  | read 1 byte + nack | stop |
 * --------|---------------------------|--------------------|--------------------|------|
 */
/*
esp_err_t i2c_master_sensor_test(i2c_port_t i2c_num, uint8_t* data_h, uint8_t* data_l)
{
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, BH1750_SENSOR_ADDR << 1 | WRITE_BIT, ACK_CHECK_EN);
    i2c_master_write_byte(cmd, BH1750_CMD_START, ACK_CHECK_EN);
    i2c_master_stop(cmd);


  // part in I.O. Device
    int ret = i2c_master_cmd_begin(i2c_num, cmd, 1000 / portTICK_RATE_MS);
    i2c_cmd_link_delete(cmd);
    if (ret == ESP_FAIL) {
        return ret;
    }


    vTaskDelay(30 / portTICK_RATE_MS);

    cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, BH1750_SENSOR_ADDR << 1 | READ_BIT, ACK_CHECK_EN);
    i2c_master_read_byte(cmd, data_h, ACK_VAL);
    i2c_master_read_byte(cmd, data_l, NACK_VAL);
    i2c_master_stop(cmd);
    ret = i2c_master_cmd_begin(i2c_num, cmd, 1000 / portTICK_RATE_MS);
    i2c_cmd_link_delete(cmd);
    if (ret == ESP_FAIL) {
        return ESP_FAIL;
    }
    return ESP_OK;
}

*/






























  // set up next idle Callback
  BH1750_Definition->common.Common_CtrlRegA |= F_WANTS_IDLE_TASK;

